Table of Contents
 Class CombiInput
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Basic class combination
public abstract class CombiInput : OpenElementId
Inheritance
object
OpenObject
OpenElementId
CombiInput
Derived
CombiInputEC
CombiInputSIA
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CombiInput()
Constructor
public CombiInput()
Properties
 Description
Additional info
public string Description { get; set; }
Property Value
string
 Items
Combi Items in combination
public List<CombiItem> Items { get; set; }
Property Value
List<CombiItem>
 Name
Name of combination
public string Name { get; set; }
Property Value
string
 Edit this page